denote/20230621T233736--this-week__code.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-07-15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>今週のニュース</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css'><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">今週のニュース</h1>

<div id="outline-container-org9e6275a" class="outline-2">
<h2 id="org9e6275a"><a href="#org9e6275a">Links</a></h2>
<div class="outline-text-2" id="text-org9e6275a">
<p>
気になったトピックのメモ。
</p>
</div>

<div id="outline-container-orgbbc747e" class="outline-3">
<h3 id="orgbbc747e"><a href="#orgbbc747e"><a href="https://www.rfc-editor.org/rfc/rfc9425.html">RFC 9425: JSON Meta Application Protocol (JMAP) for Quotas</a></a></h3>
<div class="outline-text-3" id="text-orgbbc747e">
<p>
JMAPは、電子メールの処理に関するインターネット標準の通信プロトコルのセット。メールやカレンダー、連絡先といった一般的なデータの同期するためのプロトコルでもある。
</p>

<ul class="org-ul">
<li><a href="https://ja.wikipedia.org/wiki/JSON_Meta_Application_Protocol">JSON Meta Application Protocol - Wikipedia</a></li>
</ul>

<p>
そのJMAPのQuotaの仕様。
</p>
</div>
</div>

<div id="outline-container-orgc4c9ee2" class="outline-3">
<h3 id="orgc4c9ee2"><a href="#orgc4c9ee2"><a href="https://www.rfc-editor.org/rfc/rfc9408.html">RFC 9408: A YANG Network Data Model for Service Attachment Points (SAPs)</a></a></h3>
<div class="outline-text-3" id="text-orgc4c9ee2">
<p>
YANGはデータモデル言語の一種。ネットワーク管理用プロトコルによりアクセスされるネットワーク機器の設定や状態、RPC、通知をモデル化するために開発された。
</p>

<ul class="org-ul">
<li><a href="https://ja.wikipedia.org/wiki/YANG">YANG - Wikipedia</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5dcf289" class="outline-3">
<h3 id="org5dcf289"><a href="#org5dcf289"><a href="https://github.com/docker/compose/pull/10552">introduce ability to select service to be stopped by `compose down` by ndeloof · Pull Request #10552 · docker/compose</a></a></h3>
<div class="outline-text-3" id="text-org5dcf289">
<p>
個別にdownできるようになった。これがなかったからややこしいコマンドをやる必要があった。
</p>
</div>
</div>

<div id="outline-container-orgdff7251" class="outline-3">
<h3 id="orgdff7251"><a href="#orgdff7251"><a href="https://github.com/golang/go/issues/17860">net/url: optimize unescape and escape · Issue #17860 · golang/go</a></a></h3>
<div class="outline-text-3" id="text-orgdff7251">
<p>
URLに関係する関数での高速化の方法。
</p>
</div>
</div>
<div id="outline-container-orgcb878fc" class="outline-3">
<h3 id="orgcb878fc"><a href="#orgcb878fc"><a href="https://github.com/golang/go/issues/38017">time: add time/tzdata package and timetzdata tag to embed tzdata in program · Issue #38017 · golang/go</a></a></h3>
<div class="outline-text-3" id="text-orgcb878fc">
<p>
タイムゾーン情報をシステム依存でなく、プログラム内にもたせる変更。
</p>
</div>
</div>
<div id="outline-container-orgf72f294" class="outline-3">
<h3 id="orgf72f294"><a href="#orgf72f294"><a href="https://github.com/golang/go/issues/45624">proposal: expression to create pointer to simple types · Issue #45624 · golang/go</a></a></h3>
<div class="outline-text-3" id="text-orgf72f294">
<p>
気になる提案。
</p>
</div>
</div>
<div id="outline-container-org795ebad" class="outline-3">
<h3 id="org795ebad"><a href="#org795ebad"><a href="http://localhost:8081/golang/go/issues/51317#top">proposal: arena: new package providing memory arenas · Issue #51317 · golang/go · GitHub</a></a></h3>
<div class="outline-text-3" id="text-org795ebad">
<p>
arenaのproposal。
</p>
</div>
</div>
<div id="outline-container-org173c75b" class="outline-3">
<h3 id="org173c75b"><a href="#org173c75b">Go 1.21のリリース候補がダウンロード可能になった</a></h3>
<div class="outline-text-3" id="text-org173c75b">
<p>
<a href="https://go.dev/blog/go1.21rc">Go 1.21 リリース候補 - Go プログラミング言語</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
